uhnp/src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <attributes>
    <name>СвязанныйОбъект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ОтправленныеЗадачи/ОтправленныеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтправленныеЗадачи</name>
  <resources>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Исполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/Задачи/ObjectModule.bsl
Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьРегистры();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления Тогда
		ОчиститьРегистры();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРегистры()
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросПоРегистру = Новый Запрос();
	ЗапросПоРегистру.УстановитьПараметр("Задача", Ссылка);
		
	//РегистрСведений.ОтправленныеЗадачи
	ЗапросПоРегистру.Текст = 
	"ВЫБРАТЬ
	|	ОтправленныеЗадачи.ИдентификаторСообщения КАК ИдентификаторСообщения
	|ИЗ
	|	РегистрСведений.ОтправленныеЗадачи КАК ОтправленныеЗадачи
	|ГДЕ
	|	ОтправленныеЗадачи.Задача = &Задача";
	
	ВыборкаПоРегистру = ЗапросПоРегистру.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.ОтправленныеЗадачи.СоздатьНаборЗаписей();
	
	Пока ВыборкаПоРегистру.Следующий() Цикл		
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ВыборкаПоРегистру.ИдентификаторСообщения);
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;
		
КонецПроцедуры
